Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes Properties
The EmbeddedObjectAttributes type exposes the following members.
Properties
Name | Description
Frame
 Gets or sets the frame.
Scaling
 Gets or sets the scaling type.
XScale
 Gets or sets the X scaling value. Changing this property will set the scaling type to ScaleXY.
YScale
 Gets or sets the Y scaling value. Changing this property will set the scaling type to ScaleXY.
Top
See Also
Reference
EmbeddedObjectAttributes Class
Tekla.Structures.Drawing Namespace